import React, { Component } from 'react';
import rang1 from '../image/Rang1.JPG';
import pong1 from '../image/Pong1.jpg';
import ReactGA from 'react-ga';
import Header from './Header';
import '../App.css';
import act1 from '../image/Act1.png';

class Extraact extends Component {
  state = {
    path: '/',
  };
  componentDidMount() {
    ReactGA.pageview(window.location.pathname);
  }

  render() {
    let userroute = this.state.path == '/';

    return (
      <div className="container">
        <div className="pagecontent">
          <h5>บ้านแรง</h5>
          <img src={rang1} width="50%" />
          <p>
            <b>บ้านรับน้องคือระบบโซตัส?</b>
            <br></br>
            <br></br> <strong>บ้านรับน้องไม่มีอะไร แค่ไปเต้นแร้งเต้นกา?</strong>
            <br></br>
            ผมจะมาเล่าประสบการณ์การการทำบ้านรับน้อง 3 ปีติดต่อกันให้ฟังครับ
            เรื่องแรก…บ้านรับน้องไม่ใช่แค่การเต้นแร้งเต้นกาครับ สำหรับ “บ้านแรง”
            ที่ผมเคยทำกิจกรรมมานั้น มันมีระบบการวางแผนเรื่อง{' '}
            <strong>“การบริหารจัดการคน”</strong>
            เข้ามาเกี่ยวข้อง ซึ่งเป็นการฝึกฝนเรื่อง<strong>Human Skills</strong>
            ที่หาได้ยากมากในรั้วมหาวิทยาลัย
            ทราบมั้ยครับว่า…แต่ละปีจุฬาลงกรณ์มหาวิทยาลัยจะมีนิสิตจุฬาฯ(น้องปี1)
            เข้ามาศึกษามากถึงปีละ5,000คน!
            และหนึ่งในกิจกรรมที่ทางมหาวิทยาลัยเตรียมต้อนรับน้องปี1เข้าสู่รั้วจุฬาฯ
            คือ “กิจกรรมบ้านรับน้อง” นั่นเอง จากที่กล่าวไปข้างต้น
            ผมอยู่บ้านแรงครับ บ้านแรงเป็นบ้านรับน้องที่ถือได้ว่ามีขนาดใหญ่
            รองรับน้องแต่ละปีมากกว่า500คน!
            ลองนึกภาพตามนะครับ…น้องปี1หลายร้อยชีวิตที่มีbackgroundแตกต่างกัน
            ความต้องการที่ไม่เหมือนกัน มาอยู่รวมตัวกัน
            ซึ่งก็หลีกเลี่ยงไม่ได้ที่จะตามมาพร้อมกับปัญหาอีกมากมายด้วยเช่นกัน
            ผมต้องยอมรับว่าเป็นเรื่องที่ท้าทายมาก ๆ ครับ
            เราจะเตรียมการอย่างไรให้พร้อมรับมือที่สุด
            ทั้งเรื่องการบริการจัดการคน การทำงานเป็นทีม
            การแก้ไขปัญหาที่ไม่ซ้ำกันในแต่ละวัน
            การมองการณ์ไกลถึงเหตุการณ์ที่อาจจะเกิดขึ้นในวันจริง และอีกมากมาย
            ตลอดระยะเวลา2เดือน ผมได้อะไรหลายๆอย่างจากบ้านแรง
            ผมได้มิตรภาพจากเพื่อน ได้เรียนรู้การเข้าใจคนหลากหลายรูปแบบ
            ได้ใช้ทักษะการสื่อสาร ฝึกฝนทักษะการเป็นผู้นำ
            ทักษะการตัดสินใจในเวลาคับขัน และฝึกความอดทน
            ผมรู้สึกชอบและประทับใจมาก ๆ
            นั่นเลยเป็นเหตุผลที่ผมตัดสินใจทำบ้านรับน้องมาตลอด3ปีครับ
            อีกทั้งผมยังค้นพบว่า
            บทบาทหน้าที่ที่ผมได้รับในแต่ละปีนั้นแตกต่างกันอย่างสิ้นเชิง
            ยิ่งเราโตขึ้น วุฒิภาวะเรามากขึ้น
            การมองเห็นปัญหาจากประสบการณ์ในอดีตช่วยสอนผม
            แล้วผมก็สามารถนำบทเรียนเหล่านั้น
            ไปสอนน้องๆที่เข้ามาเป็นทีมงานต่อไปได้
          </p>
        </div>
        <div className="pagecontent">
          <h5>ชมรมปิงปองวิศวกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย</h5>
          <img src={pong1} width="50%" />
          <p>
            ผมเป็นส่วนหนึ่งในชมรมปิงปองที่มหาวิทยาลัยครับ
            สิ่งที่ผมทำเริ่มตั้งแต่เป็นนักกีฬาในการแข่งขัน Freshy game
            (ชั้นปีที่1) ไปจนถึงการเป็นประธานชมรม(ชั้นปีที่3) เลยครับ
            สิ่งที่ผมทำตอนแรกคือ แข่งขันในนามของคณะ เข้าร่วมกิจกรรมต่างๆ
            แต่พอชั้นปีสูงขึ้น
            ผมกลับเริ่มอยากแข่งขันน้อยลงและหันมาสนับสนุนน้องๆเข้าร่วมแข่งขันมากขึ้น
            ผมจึงหันมาดูแลด้านการจัดการภายในชมรมแทน เช่น การทำเสื้อ
            การระดมทุนเข้าชมรม และเมื่อขึ้นชั้นปีที่3 ผมก็เป็นประธานชมรม
            มีโอกาสได้รู้จักกับน้องๆในชมรมเพิ่มขึ้นครับ (ตามในรูปประกอบ)
            นอกจากนี้ สิ่งที่ชมรมปิงปองให้มากกว่ากีฬา คือ
            การที่ผมได้ลองจัดการอะไรหลายอย่าง
            ไม่ว่าจะเป็นการเขียนเอกสารเสนอเปิดโครง วางแผนด้านการเงิน
            วางแผนกิจกรรม
            ทำทุกอย่างไปจนถึงปิดโครงและเบิกงบออกมาจนมาเป็นชมรมปิงปองทุกวันนี้
            เรียกได้ว่าผมได้ลงมือทำตั้งแต่เริ่มต้นจนกระทั่งสิ้นสุดกระบวนการเลยละครับ
            ในส่วนการเล่นกีฬา นอกจากมันจะสอนให้เรามีน้ำใจนักกีฬาแล้ว
            มากไปกว่านั้นมันสอนให้เรารู้จักถึง
            <strong>ความอดทนและระเบียบวินัย</strong>
            เพราะเราต้องซ้อมกีฬาเป็นเวลาอย่างสม่ำเสมอ
            ต้องใช้วินัยทั้งในสนามและนอกสนามซ้อม
            ปิงปองเป็นกีฬาประเภทเดี่ยวก็จริงครับ
            แต่ความลับที่หลายคนอาจจะยังไม่เคยทราบ นั่นคือ
            การแข่งขันแบบเป็นคู่หรือแข่งเป็นทีม มันย่อมมีมิติมากกว่าทำคนเดียว
            กล่าวคือ หากแข่งขันคนเดียว
            ความกดดันจะมาจากตัวเราเองหรือไม่ก็มาจากคู่แข่งฝ่ายตรงข้าม
            แต่หากแข่งขันเป็นทีม
            เราเพียงลำพังอาจไม่ได้มีความสามารถเฉพาะตัวที่จะไปแข่งขันกับฝ่ายตรงข้ามได้
            แต่ผมเชื่อเสมอว่า <strong>“ทีมของเรา”</strong>{' '}
            จะสามารถทำให้เราทำอะไรได้หลายอย่าง เพียงแค่คนในทีมเชื่อใจกัน
            เชื่อว่าคู่หูเราจะสามารถดึงประสิทธิภาพออกมาได้แบบเต็มร้อย
            คอยเสริมพลังให้กันและกันเสมอ
            นั่นแหละครับคือความลับของความสนุกที่เกิดขึ้นจากกีฬา
            จากประสบการณ์ที่ผ่านมาผมได้เรียนรู้ว่า
            ภาพที่เกิดขึ้นในการแข่งขันในสนามจริงสะท้อนสภาพความเป็นอยู่ของเรานอกสนาม
            ตัวอย่างเช่น การที่คนในทีมให้กำลังใจ ตะโกนเชียร์เราติดขอบสนาม
            ล้วนเกิดจากความใส่ใจที่เรามอบให้เขาตั้งแต่ตอนฝึกซ้อม
            ดังนั้นผมจึงได้ตระหนักว่า
            การสร้างทีมที่เข้มแข็งเกิดจากการหล่อหลอมตั้งแต่ตอนฝึกซ้อม
            ถ้าเราเต็มที่กับมัน ไม่ว่าผลจะออกมาเป็นอย่างไร
            เราก็จะสนุกกับทีมเราเสมอ สุดท้ายนี้
            สำหรับผมชมรมปิงปองเป็นอีกหนึ่งกิจกรรมที่คุ้มมากๆ
            และผมก็อยู่กับมันทั้งชีวิตมหาลัยของผมเลยครับ
          </p>
        </div>
      </div>
    );
  }
}

export default Extraact;
