import React, { Component } from 'react';
import '../App.css';
import zofair from '../image/Zofair.png';
import intern2 from '../image/Intern2.JPG';
import mitsu from '../image/Mitsu.jpg';

export default class Intern extends Component {
  render() {
    return (
      <div className="background">
        <div className="pagecontent">
          <h5>Pleasant Perfect Co., Ltd.</h5>
          <p>Marketing Execusive</p>
          <img src={zofair} width="50%" />
          <p>
            ผมฝึกงานอีกครั้งหลักจากที่ฝึกงานตามสยงานไปแล้ว
            เพื่อค้นหาตัวเองเพิ่มเติมแหละเพื่อลองทำงานดูจริงๆ ผมฝึกงานในสาย
            Marketing ซึ่งเอาจริงๆก็สนุกดีครับ บริษัทที่ผทำ ทำเกี่ยวกับ Travel
            Tech ผมได้ลองทำ ในส่วนของ Marketing Strategy ผมได้รู้จักกับ
            Marketing business tools ทั้งหลายไม่ว่าจะเป็นของ Facbook หรือของ
            Google
            เพื่อค้นหาตัวเองเพิ่มเติมแหละเพื่อลองทำงานดูจริงๆทั้งนี้รวมไปถึงหลักการของ
            SEO SEM หรือจะเป็นการทำโฆษณาต่างๆ ในโลกของ Marketing
            มีอะไรที่สนุกๆมากมายเลยครับ ถึงจะมีบางส่วนไม่สนุกบ้างก็ตาม
            และผมก็โชคดีที่พี่ที่สอนงานผมได้ปูพื้นฐาน ทั้งวิธีการทำงาน
            การทำงานแบบเป็นทีม การทำงานแบบ Agile
            และมันก็ยิ่งท้าทายขึ้นไปอีกด้วยสถาณการณ์ COVID-19
            เพราะมันทำให้เราทำงานยากขึ้น
            แต่พี่ๆก็ปรับวิธีการทำงานที่สามารถทำให้เราสามารถทำงานได้จากที่บ้าน
            ผมคิดว่าเป็นประสบการณ์ที่ดีมากสำหรับผม ผมรู้สึกดีกับสิ่งที่ผมทำ แต่
            ณ
            ตอนนี้มันยังไม่ใช่สิ่งที่ทำให้ผมรู้สึกว่าบ้าและอยากตื่นขึ้นมาทำทุกวัน
            ผมรู้สึกสนุก
            และผมก็ยังไม่แน่ใจว่าเมื่อถึงวันนึงผมจะบ้ามันไหมในโลกของ Marketing
          </p>
        </div>
        <div className="pagecontent">
          <h5>Mitsubishi Motors (Thailand) Co., Ltd.</h5>
          <p>Research and Development</p>
          <img src={mitsu} width="50%" />
          <p>
            เมื่อจบปี3 ผมต้องไปฝึกงานแบบตรงสาย ซึ่งบริษัทที่รับผมเข้าไปคือ
            มิตซูบิชิ มอเตอร์ ผมเข้าไปทำในแผนกวิจัยและพัฒนาของบริษัท
            หัวข้อที่ผมได้รับ
            กับงานที่ผมทำอาจจะพูดถึงไม่ได้เนื่องจากผมไม่รู้ว่าเปิดเผยได้ไหม
            แต่สิ่งที่ผมทำคือการที่ผมได้ลองทำการวิัยหนึ่งขึ้นมาเพื่อดูว่ามันมีผลกระทบกับบริษัทอย่างไร
            การที่บริษัทใหญ่ๆจะตัดสินใจอะรซักอย่าง
            อาจจะส่งผลอย่างมากต่อกำไรของเขา ทำให้ต้องวิจัยก่อนจะตัดสินใจทำอะไร
            ข้อดีของการอยู่แผนกนี้คือเราจะได้เห็นงานเกือบทุกๆฝ่ายในส่วนการผลิตของบริษัท
            ทำให้ผมเรียนรู้ทั้งกระบวนการศึกษาและค้นคว้า
            และยังเรียนรู้ขั้นตอนการผลิตซึ่งเป็นสิ่งที่ดีสำหรับวิศวกรรมเครื่องกล
          </p>
          <img src={intern2} width="50%" />
          <p className="center">
            รูปนี้เป็นรูปหลังจากการเลิกงานกับที่บริษัทแล้วพี่เขาชวนไปออกกำลังกาย
            ผมก็ไป ช่วงนั้นรู้สึกสนุกดีและได้ลองเจออะไรใหม่ๆที่แปลกๆไปอีกแบบ
          </p>
        </div>
      </div>
    );
  }
}
