import React, { Component } from 'react';
import '../App.css';
import zofair from '../image/Zofair.png';

export default class Intern extends Component {
  render() {
    return (
      <div className="background">
        <div className="pagecontent">
          <h5>Pleasant Perfect Co., Ltd.</h5>
          <p>Marketing Execusive</p>
          <img src={zofair} width="50%" />
          <p>
            ผมฝึกงานอีกครั้งหลักจากที่ฝึกงานตามสยงานไปแล้ว
            เพื่อค้นหาตัวเองเพิ่มเติมแหละเพื่อลองทำงานดูจริงๆ ผมฝึกงานในสาย
            Marketing ซึ่งเอาจริงๆก็สนุกดีครับ บริษัทที่ผทำ ทำเกี่ยวกับ Travel
            Tech ผมได้ลองทำ ในส่วนของ Marketing Strategy ผมได้รู้จักกับ
            Marketing business tools ทั้งหลายไม่ว่าจะเป็นของ Facbook หรือของ
            Google
            เพื่อค้นหาตัวเองเพิ่มเติมแหละเพื่อลองทำงานดูจริงๆทั้งนี้รวมไปถึงหลักการของ
            SEO SEM หรือจะเป็นการทำโฆษณาต่างๆ ในโลกของ Marketing
            มีอะไรที่สนุกๆมากมายเลยครับ ถึงจะมีบางส่วนไม่สนุกบ้างก็ตาม
            และผมก็โชคดีที่พี่ที่สอนงานผมได้ปูพื้นฐาน ทั้งวิธีการทำงาน
            การทำงานแบบเป็นทีม การทำงานแบบ Agile
            และมันก็ยิ่งท้าทายขึ้นไปอีกด้วยสถาณการณ์ COVID-19
            เพราะมันทำให้เราทำงานยากขึ้น
            แต่พี่ๆก็ปรับวิธีการทำงานที่สามารถทำให้เราสามารถทำงานได้จากที่บ้าน
            ผมคิดว่าเป็นประสบการณ์ที่ดีมากสำหรับผม ผมรู้สึกดีกับสิ่งที่ผมทำ แต่
            ณ
            ตอนนี้มันยังไม่ใช่สิ่งที่ทำให้ผมรู้สึกว่าบ้าและอยากตื่นขึ้นมาทำทุกวัน
            ผมรู้สึกสนุก
            และผมก็ยังไม่แน่ใจว่าเมื่อถึงวันนึงผมจะบ้ามันไหมในโลกของ Marketing
          </p>
        </div>
        <div className="pagecontent">
          <h5>Pleasant Perfect Co., Ltd.</h5>
          <p>Marketing Execusive</p>
          <img src={zofair} width="50%" />
          <p>
            ผมฝึกงานอีกครั้งหลักจากที่ฝึกงานตามสยงานไปแล้ว
            เพื่อค้นหาตัวเองเพิ่มเติมแหละเพื่อลองทำงานดูจริงๆ ผมฝึกงานในสาย
            Marketing ซึ่งเอาจริงๆก็สนุกดีครับ บริษัทที่ผทำ ทำเกี่ยวกับ Travel
            Tech ผมได้ลองทำ ในส่วนของ Marketing Strategy ผมได้รู้จักกับ
            Marketing business tools ทั้งหลายไม่ว่าจะเป็นของ Facbook หรือของ
            Google
            เพื่อค้นหาตัวเองเพิ่มเติมแหละเพื่อลองทำงานดูจริงๆทั้งนี้รวมไปถึงหลักการของ
            SEO SEM หรือจะเป็นการทำโฆษณาต่างๆ ในโลกของ Marketing
            มีอะไรที่สนุกๆมากมายเลยครับ ถึงจะมีบางส่วนไม่สนุกบ้างก็ตาม
            และผมก็โชคดีที่พี่ที่สอนงานผมได้ปูพื้นฐาน ทั้งวิธีการทำงาน
            การทำงานแบบเป็นทีม การทำงานแบบ Agile
            และมันก็ยิ่งท้าทายขึ้นไปอีกด้วยสถาณการณ์ COVID-19
            เพราะมันทำให้เราทำงานยากขึ้น
            แต่พี่ๆก็ปรับวิธีการทำงานที่สามารถทำให้เราสามารถทำงานได้จากที่บ้าน
            ผมคิดว่าเป็นประสบการณ์ที่ดีมากสำหรับผม ผมรู้สึกดีกับสิ่งที่ผมทำ แต่
            ณ
            ตอนนี้มันยังไม่ใช่สิ่งที่ทำให้ผมรู้สึกว่าบ้าและอยากตื่นขึ้นมาทำทุกวัน
            ผมรู้สึกสนุก
            และผมก็ยังไม่แน่ใจว่าเมื่อถึงวันนึงผมจะบ้ามันไหมในโลกของ Marketing
          </p>
        </div>
      </div>
    );
  }
}
