import React, { Component } from 'react';
import '../App.css';
import IT1 from '../image/IT1.JPG';
import senior1 from '../image/Senior1.png';

export default class ItProj extends Component {
  render() {
    return (
      <div className="background">
        <div className="pagecontent">
          <h5>Senior Project</h5>
          <img src={senior1} width="50%" />
          <p>
            นี่คือครั้งแรกเลยครับที่ผมได้ลองเขียนเว็บแบบง่ายๆ
            ถึงผมจะอยู่สาขายานยนต์และการออกแบบ แต่เมื่อผมตัดสินใจอย่างชัดเจนว่า
            ผมไม่ได้อยากอยู่ในสายโรงงานผมจึงเลือกโปรเจ็คที่ไม่เกี่ยวกับสาขาที่ตัวเองเรียนเลย
            และก็โชคดีที่อาจารย์ก็ให้โอกาสผม หัวข้อที่ผมทำชื่อว่า "Image
            Processing for Medical Treatment" เป็นการที่ใช้ Machine learning
            เพื่อประมวลผลจากภาพ
            ดูว่าคนไข้มีอาการแพ้ยาหรือไม่จากภาพที่ผู้ป่วยส่งมา
            แต่ปัญหามีอยู่เต็มไปหมด
            เริ่มจากการที่ผมไม่สามารถเข้าถึงแหล่งข้อมูลทางการแพทย์ได้
            ทำให้ผมต้องเขียนวิธีการดึงข้อมูลที่สำคัญออกมาเอง
            เพราะว่าข้อมูลที่สามารถนำไปสอน machine learning มีอย่างจำกัด
            และเมื่อทำการสอนและทำจนเกือบจะจบกระบวนการ ผมกับเพื่อนก็เริ่มคิดว่า
            "อ้าว! แล้วเราจะแสดงผลอย่าไร"
            จึงทำให้ผมต้องดิ้นรนอีกครั้งเพื่อหาวิธีการที่จะแสดงผล
            โชคดีที่ตอนนั้นยังมีเวลา ผมเลยเริ่มศึกษา Library ที่สามารถทำ Web
            application ได้แบบคร่าวๆ เป็นภาษา Python จึงทำให้ผมเริ่มรู้จัก
            Library ที่ชื่อว่า Django นี่แหละครับคทอชนวนที่ทำให้ผมมานั่งทำ Web
            application อันนี้และศึกษาเพิ่มเติม
            เพราะผมเริ่มรู้สึกว่าจริงๆมันก็สนุกดีนะ
            ผมตอบตัวเองไม่ได้เลยตัดสินใจเริ่มศึกษาแล้วลองทำมันดูสักครั้ง
            จะได้รู้ไปเลยว่าเราจะชอบมันจริงๆไหม
          </p>
        </div>
        <div className="pagecontent">
          <h5>IOT Project</h5>
          <img src={IT1} width="50%" />

          <p>
            วิชา IOT ผมเริ่มเรียนตอน ป4 เทอม1
            ซึ่งตอนนั้นเป็นช่วงหลักจากที่ผมฝึกงานตามที่คณะบังคับเสร็จเรียบร้อยแล้ว
            ผมรู้แล้วว่าผมไม่อยากทำสายยานยนต์ต่อ
            ก็เลยอยากจะลงวิชาที่ออกแนวสารสนเทศน์มากขึ้น
            ด้วยความที่ผมเก็บพวกวิชาภาคเกือบหมดแล้ว จึงมีโอกาสได้ลงวิชาเลือก
            จึงเลือกวิชานี้มาลง ในวิชานี้ผมได้เรียนเกี่ยวกับภาษา C โดยใช้บอร์ด
            STM32 แและได้ใช้ Raspberry PI โดยเขียน เป็นภาษา Python
            ที่น่าสนุกกว่านั้นคือการที่จะจบวิชานี้ได้
            อาจารย์บังคับให้ใช้ทั้งสองบอร์ดและให้มันสื่อสารซึ่งกันและกันได้
            ใช้อย่างน้อย 3 อุปกรณืที่ต่อเป็นภาษา C และบังคับใช้ Pi Camera
            ที่ต่อกับ Raspberry PI ในส่วนนี้ก็อาจจะฟังดูดี
            แต่ที่หนักกว่านั้นคือการให้ใช้ Machine learning
            เข้ามาผสมด้วยโดยไม่กำหนดหัวข้อ กำหนดแค่สิ่งที่ต้องใช้
            ผมเลือกที่จะใช้ Machine learning เพื่อประมวลภาพ เพราะผมต้องทำใน
            Senior Project อยู่แล้ว โดยใช้ Library ของ Keras
            ผมนำเสนอโปรเจ็คที่สามารถจับภาพได้ว่าผู้ใช้งานต้องการให้หุ่นยนต์เดินไปที่สถาณีไหนแล้วให้หุ่นยนต์เดินตาม
            วิชานี้เรียกได้ว่าเบิกความรู้ใหม่มาเยอะพอสมควร
            และยังอยากขอบคุณอาจารย์ที่ให้โอกาสเด็กที่ไม่มีความรู้ได้ลองทำดู
          </p>
        </div>
      </div>
    );
  }
}
