import React, { Component } from 'react';
import zofair1 from '../image/zofair1.jpg';
import startup1 from '../image/Startup1.jpg';

export default class Startup extends Component {
  render() {
    return (
      <div className="container">
        <div className="pagecontent">
          <h5>Zofair.com</h5>
          <div className="mitsu">
            <img src={zofair1} width="30%" />
          </div>
          <p>
            Zofair.com เป็นสิ่งที่ผมกำลังทำในฐานะน้องฝึกงานที่ Plesantperfect
            Co.,Ltd
            ผมปฏิเสธไม่ได้เลยว่าผมเห็นโลกกว้างมากขึ้นจากการที่ผมได้ฝึกงานที่นี่
            ก่อนหน้านี้ผมได้แต่คิดและทำกิจกรรมที่เกี่ยวกับธุรกิจมาบ้าง
            แต่การฝึกงานที่นี่มันคือการที่ผมได้เห็นสนามจริงๆ
            ได้วิเคราะห์จริงๆบนพื้นฐานของธุรกิจที่กำลังทำอยู่
            ไม่ใช่วิเคราะห์บนพื้นฐานของความฝัน
            ผมได้รับหหน้าที่ให้ทำทำแผนการตลาดสำหรับ Zofair.com
            ซึ่งมันก็ต้องผ่านขั้นตอนทั้ง วิเคราะห์ตัวเอง วิเคราะห์ตลาด
            วิเคราะห์คู่แข่ง วิเคราะห์ลูกค้า
            จนสุดท้ายก็ทำแผนการตลาดออกมาจากข้อมูลที่เรามีในมือ
            และทุกอย่างก็ถูกเปลี่ยนไปแบบกระทันหันด้วยวิกฤต COVID-19
            ทำให้แผนที่เราวางมาอาจจะต้องเปลี่ยนไป รวมไปถึงรูปแบบการทำงาน
            ซึ่งมันเป็นอะไรที่ท้าทายพอสมควร<br></br>
            โดยสรุปนะครับ การไปฝึกงานที่Plesantperfect Co.,Ltd
            มันทำให้ผมมองโลกธุรกิจได้กว้างขึ้น มองอะช่องทางได้ลึกขึ้น
            รู้จักเครื่องมือเยอะขึ้น และรวมไปถึงการเข้าถึงแหล่งข้อมูลที่เร็วขึ้น
            ผมรู้สึกประทับใจมากกลับทีมที่นี่
            และยังหวังว่าวันหน้าผมจะพัฒนาตัวเองจะกลับมาช่วยเหลือพี่ๆได้บ้างเหมือนที่พี่ๆคอยช่วยเหลือผม
          </p>
        </div>
        <div className="pagecontent">
          <h5>Beat the Biz Competition</h5>
          <img src={startup1} width="50%" />
          <p>
            Beat the Biz เป็นโครการของ Chula Entrepreneur Organization
            เป็นรายการแข่งการทำประกวดธุรกิจ
            โดยให้เราคิดธุรกิจขึ้นมาลองทำและนำเสนอ{''}
            กรรมการผู้ตัดสินคือผู้ที่ทำธุรกิจอยู่และถูกทางโครงการเชิญมา
            และแต่ละท่านล้วนแต่มีธุรกิจเป็นของตนเองและกำลังประกอบกิจการของตัวเองอยู่
            ในรายการนี้ทีมผมนำเสนอ platform
            ที่สามารถติดตามคนรอบตัวเราได้และพยายามจะเป็น platform
            ที่ทำให้คนสามารถนัดมาเจอกันได้
            โดยจุดเริ่มต้นมาจากการที่คนรอบหลายคนตัวมีปัญหากับการอยู่คนเดียว
            และต้องการหาเพื่อนเพื่ออยู่ด้วย แต่ด้วยปัจจุบันยังไม่มี platform
            ที่สามารถทำให้เรานัดไปทำกิจกรรมร่วมกันหรือออกมาเจอกันได้จึงคิดที่จะทำ
            platform นี้ขึ้นมา<br></br>ทีมเราตั่งเป้าหมายไว้ว่า
            อยากจะลองทำแบบจริงจังดูซักครั้งจะได้รู้ว่าเราขาดอะไรแล้วการทำงานแบบไหนที่จะดีต่อทุกคน
            ถึงกิจกรรมครั้งนี้เราจะไม่ชนะ แต่เราค่อนข้างบรรลุเป้าหมายพอสมควร
            เราทำงานกันค่อนข้างหนัก แต่เรายังไม่มีการทะเลาะกันในทีม
            ทุกคนสามารถแบ่งเวลามาร่วมกิจกรรมได้
            และไม่มีใครที่ต้องแบกรับอะไรไว้ในทีม
            อีกทั้งเรายังได้ความรู้จากการแชร์ประสบการณ์การทำธุรกิจของพี่ๆที่กำลังประกอบธุรกิจอยู่หลายท่าน
            และที่สำคัญที่สุด เราได้เห็นว่าแนวคิดไหนที่ดีต่อการทำธุรกิจ
            จากการที่เราสังเกตุผู้ที่ได้รับหลายวัลจากหลายทีม และคำถามของกรรมการ
          </p>
        </div>
      </div>
    );
  }
}
