import React, { Component } from 'react';
import ReactGA from 'react-ga';

export default class Summary extends Component {
  componentDidMount() {
    ReactGA.pageview(window.location.pathname);
  }
  render() {
    return (
      <div className="container">
        <div className="pagecontent">
          <h5>
            <strong>นี่คือบทสรุปเรื่องราวของผมนะครับ</strong>
          </h5>
          <br></br>

          <p>
            . . . สวัสดีครับ ผมชื่อ “เอก” นายเอกวิล วิริยะภาค
            กำลังจะสำเร็จการศึกษาจากคณะวิศวกรรมศาสตร์
            วิชาภาคการออกแบบและการผลิตยานยนต์ (ADME) จุฬาลงกรณ์มหาวิทยาลัย . .
            เหตุผลที่ผมสร้างเว็บไซต์ของผมเองขึ้นมา มี 2 จุดประสงค์ครับ<br></br>
            <br></br>
            1.เพื่อศึกษาความชอบของตัวเองในด้านการเขียนโค้ด
            2.เพื่อใช้เป็นหลักฐานยืนยันถึงความสามารถด้านการเขียนโค้ด<br></br>
            <br></br>
            จุดเริ่มต้นของความชอบด้านการเขียนโค้ดของผม
            ย้อนกลับไปตอนผมศึกษาอยู่ชั้นม.ปลาย ผมมีโอกาสได้เรียนวิชาชื่อ
            “Software Engineering” วิชานี้สอนเกี่ยวกับการเขียนโค้ดเบื้องต้น ณ
            ตอนนั้น ผมรู้สึกว่าวิชานี้เป็นวิชาที่น่าปวดหัวครับ
            เพราะต้องใช้การคิดที่เป็นระบบ
            แต่ผมก็ผ่านมาได้ด้วยการใช้ความพยายามและใช้สมาธิ
            และมันทำให้ผมค้นพบว่าจริงๆแล้ว
            “ผมก็มีความสามารถในการเขียนโค้ดในระดับหนึ่ง” <br></br>
            <br></br> ผมค้นหาความชอบที่แท้จริง ช่วงนั้นกำลังจะเข้ามหาวิทยาลัย
            ผมต้องตัดสินใจว่า “จะเรียนสาขาอะไร?” สาขายานยนต์ก็เป็นสิ่งที่ผมชอบ
            แต่อีกใจผมก็ลังเลที่จะเลือกทางสายคอมพิวเตอร์ ผมเกิดความไม่แน่ใจ
            แต่ผมตัดสินใจด้วยความคิดที่ว่า “เราคงไม่ชอบสาขาคอมหรอก มันน่าปวดหัว
            และคนอื่นๆที่มีลักษณะคล้ายเราก็ไม่มีใครมาทางสายนี้”
            สุดท้ายผมจึงเลือกสาขายานยนต์ครับ การเรียนตลอด4ปีในรั้วมหาวิทยาลัย
            ผมบอกได้เต็มปากเลยครับว่า ผมดีใจที่ได้เรียนสาขานี้
            ผมไม่เคยเสียดายหรือเสียใจกับการตัดสินใจวันนั้น
            สาขายานยนต์ยังคงเป็นสิ่งที่ผมชอบอยู่ ผมยังชอบฟิสิกส์
            และผมคิดว่าอย่างไรก็ตาม
            วิศวกรรมเครื่องกลยังคงเป็นสิ่งที่คลาสสิกและพบเจอได้ในชีวิตประจำวันของผม
            ไม่ว่าจะเป็นการขับรถ ขึ้นรถไฟฟ้า หรือวิ่งออกกำลังกาย ฯ
            ผมฝึกงานตามสาขาที่เรียนเป็นภาคบังคับจากมหาวิทยาลัย
            กล่าวคือผมได้ไปทำในส่วนของโรงงานรถยนต์
            ผมได้เห็นการทำงานของหลายๆฝ่ายในองค์กร
            ตั่งแต่ก่อนจะฝึกงานผมก็ตั่งเป้าหมายกับการฝึกงานครั้งนี้ว่า
            "ผมจะตอบตัวเองให้ได้ว่าผมชอบสายงานยานยนต์จริงๆหรือไม่"
            ตั่งแต่วันแรกที่ผมเจอพี่ที่ดูแลผม ผมก็บอกเขาถึงจุดประสงค์ของผม
            จนกระทั่งสิ้นสุดการฝึกงาน...ผมก็ตระหนักได้ว่า
            “สิ่งที่ผมชอบเรียนนั้นอาจจะไม่ได้เป็นลักษณะงานที่ผมชอบทำสักเท่าไหร่”
            ผมบอกตัวเองเลยว่า ผมจะไม่กลับไปทำงานที่โรงงานรถยนต์อีก
            และผมก็เริ่มค้นหาตัวเองอีกครั้งว่า “ผมชอบอะไรกันแน่”
            <br></br>
            <br></br>ผมรู้ตัวช้ากว่าคนอื่น
            ผมเริ่มวางแผนเพื่อจะค้นหาตัวเองในช่วงปีสุดท้ายของมหาวิทยาลัย
            ผมได้ลองทำอะไรหลายๆอย่างที่แตกต่างออกไปจาก3 ปีที่ผ่านมาอย่างสิ้นเชิง
            ผมลงเรียนในวิชาที่ไม่คุ้นเคย เช่น วิชาเกี่ยวกับคอมพิวเตอร์
            วิชาของคณะบัญชีฯ และผมก็ได้ลองฝึกงานกับบริษัทแห่งนึงในตำแหน่ง
            Marketing Executive
            จากการค้นหาตัวเองทั้งหมดนี้...ผมลองทำในฐานะที่ไม่เคยทำมาก่อนและลองเข้าไปศึกษาให้รู้
            แต่สุดท้ายผมก็กลับมาทบทวนตัวเองอีกครั้งด้านการเขียนโค้ด
            สิ่งที่ผมเคยบอกตัวเองมาตลอดว่า ผมไม่ชอบ
            มันคือความจริงหรือที่ผ่านมาผมแค่หลอกตัวเอง
            ตอนนั้นเราไม่อยากทำเพราะมันปวดหัว ใช้ความคิดเยอะ
            แต่พอได้ทำอะไรหลายๆอย่างมากขึ้นก็พบว่า
            “ไม่ว่าจะทำอะไรมันก็ต้องปวดหัว คิดเยอะเช่นกัน”
            ทางเดียวที่จะพิสูจน์ว่าผมชอบ/ไม่ชอบการเขียนโค้ด
            ผมจึงตัดสินใจใช้เวลาโค้งสุดท้ายของชีวิตในมหาวิทยาลัยในการศึกษาการทำเว็บไซต์เพื่อเขียนโค้ด
            แล้วลองลงมือทำจริง จนออกมาเป็นเว็บไซต์นี้ครับ จนถึงปัจจุบัน
            ผมก็ยังไม่รู้ครับว่าผมชอบอะไร
            แต่ทุกวันที่ผ่านไปผมเริ่มมั่นใจมากขึ้นว่าผมหลอกตัวเองว่าผมไม่ชอบการเขียนโค้ด
            อย่างไรก็ตามผมยังไม่ขอใช้คำว่า “ผมชอบมัน” ผมขอเรียกว่า ณ
            ตอนนี้ผมยังอยากศึกษามันในทุกๆวัน
            อยากเรียนรู้เพิ่มเติมอย่างต่อเนื่องครับ . . <br></br>
            <br></br>ผมได้พิสูจน์ ผมเชื่อว่าบนโลกนี้มีคนอีกเป็นมากมายที่คล้ายผม
            คนที่ไม่ได้เรียนทางนี้มาโดยตรง
            พวกเขามีวิธีการอย่างไรในการฝึกทักษะเพื่อที่จะไปยืนยันกับบริษัทได้ว่า
            “เราสามารถเขียนโค้ดได้”...? การพูดปากเปล่าหรือมีใบรับรอง
            อาจจะไม่มีน้ำหนักนัก ผมจึงทำเว็บไซต์นี้ขึ้นมา เพื่อยืนยันว่า
            “แม้ผมจะไม่ได้เรียนด้านนี้มาโดยตรง
            แต่ผมศึกษาการเขียนโค้ดและสามารถทำมันได้จริง” ณ
            ตอนนี้ผมอาจจะยังไม่เก่งหรือเชี่ยวชาญมากนัก
            แต่ผมคิดว่าผมจะพัฒนาต่อไปในทุกๆวันครับ
            ผมอาจส่งเว็บไซต์นี้ให้ทุกท่านได้รับพิจารณาในฐานะผู้สมัครงานคนหนึ่ง
            หากท่านใดได้เข้ามาอ่านข้อความเหล่านี้
            ผมขอขอบคุณที่ให้ความสนใจและให้โอกาสพิจารณาผลงานชิ้นนี้ของผม
            <br></br>
            และผมหวังว่าผมจะได้มีโอกาสแนะนำตัวให้ทุกท่านรู้จักในฐานะผู้ถูกสัมภาษณ์นะครับ
            <br></br>
            <br></br>
            ขอบคุณครับ <br></br>
            <br></br>เอกวิล วิริยะภาค
          </p>
        </div>
      </div>
    );
  }
}
