import React, { Component } from 'react';
import ReactGA from 'react-ga';

export default class Summary extends Component {
  componentDidMount() {
    ReactGA.pageview(window.location.pathname);
  }
  render() {
    return (
      <div className="pagecontent">
        <h5>บ้านแรง</h5>

        <p>
          บ้านรับน้องกิจกรรมที่ผมทำแล้วรู้สึกชอบมากๆ บ้านแรงเป็นบ้านรับน้องครับ
          กิจกรรมรับน้องที่ว่านั้นจะถูกจัดขึ้นทุกๆปี ในช่วง ต้นเดือนสิงหาคม
          เพื่อนรับนิสิตใหม่เข้ามาเป็นน้องในรั้วจุฬาลงกรณ์มหาวิทยาลัย ทุกๆปี
          บ้านแรงจะรับน้องเข้ามาในบ้านมากกว่า 500 คน
          และต่อปีเราจะมีทีมงานที่ทำงานด้วยกันประมาน 100 คน
          ก่อนที่เราจะไปรับน้องในวันจริง
          เราก็จะต้องมีการเตรียมงานให้เรียบร้อยก่อน
          เตรียมความพร้อมเพื่อที่วันจริงทุกอย่างจะได้เป็นระบบ
          ซึ่งการเตียมการนั้น กินเวลาไปถึง2เดือนเลยครับ
          ซึ่ง2เดือนนี้เป็น2เดือนที่ สนุก และเหนื่อมากๆ
          เป็นกิจกรรมที่ผมรู้สึกคุ้มในช่วงปิดเทอมครับ
          การทำงานร่วมกับคนเยอะๆนั้นยาก เราต้องเรียนรู้ที่จะเข้าใจคน
          และเรียนรู้ที่จะสื่อสารอย่างมีประสิทธิภาพ
          มากไปกว่านั้นมันยังทำให้ผมได้เจอคนหลากหลายรูปแบบ
          สิ่งที่ได้จากกิจกรรมนี้คือทักษะทางด้านอารมณ์ล้วนๆเลยครับ ไม่ว่าจะเป็น
          ทักษะการทำงานร่วมกับผู้อื่น ทักษะการสื่อสาร ทักษะการเป็นผู้นำ
          ทักษะการตัดสินใจในเวลาคับขัน และความอดทนครับ
        </p>
      </div>
    );
  }
}
